ATsupportum/src/Documents/СписаниеСоСчетаКлиента_ат/СписаниеСоСчетаКлиента_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСоСчетаКлиента_ат</name>
  <registerRecords>AccountingRegister.Клиентский_ат</registerRecords>
  <attributes>
    <name>ВнешнийНомер</name>
    <type>
      <types>DefinedType.ТипВнешнегоНомера_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.Реализация_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ATsupportum/src/AccountingRegisters/Клиентский_ат/Клиентский_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Клиентский_ат</name>
  <chartOfAccounts>ChartOfAccounts.Клиентский_ат</chartOfAccounts>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

ATsupportum/src/Catalogs/Договоры_ат/Договоры_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры_ат</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты_ат</owners>
  <attributes>
    <name>Автопролонгация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.ВидыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипыОплатыПоДоговорам_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасторжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПостоплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитСуммыПриПостоплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВнутреннее</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноВнешнееСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаАрендуОборудования_ат</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>CatalogRef.Проекты_ат</types>
      <types>DocumentRef.ЗаявкаНаАрендуПП_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДанныхДляОпределенияТарифногоПлана</name>
    <type>
      <types>EnumRef.ПериодДанныхДляОпределенияТарифногоПлана_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьРеализаций</name>
    <type>
      <types>EnumRef.ПериодичностиРеализаций_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСчетов</name>
    <type>
      <types>EnumRef.ПериодичностиСчетов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасторжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодДоговора</name>
    <type>
      <types>EnumRef.РодыДоговоров_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодписанияРеализации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаТарифногоПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС_ат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ATsupportum/src/ChartsOfCharacteristicTypes/ВидыСубконто_ат/ВидыСубконто_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто_ат</name>
  <type>
    <types>DocumentRef.СчетНаОплату_ат</types>
    <types>CatalogRef.Договоры_ат</types>
    <types>DocumentRef.Задание_ат</types>
    <types>DocumentRef.Согласование_ат</types>
    <types>DocumentRef.ФиксацияРабот_ат</types>
    <types>CatalogRef.СодержанияРабот_ат</types>
    <types>DocumentRef.Реализация_ат</types>
  </type>
  <predefined>
    <items>
      <name>Договор</name>
      <description>Договор</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Договоры_ат</types>
      </type>
    </items>
    <items>
      <name>Документ</name>
      <description>Документ</description>
      <code>000000002</code>
      <type>
        <types>DocumentRef.СчетНаОплату_ат</types>
        <types>DocumentRef.Согласование_ат</types>
        <types>DocumentRef.ФиксацияРабот_ат</types>
        <types>DocumentRef.Реализация_ат</types>
      </type>
    </items>
    <items>
      <name>Объект</name>
      <description>Объект</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.СодержанияРабот_ат</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ATsupportum/src/Documents/СписаниеСоСчетаКлиента_ат/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = ЭтотОбъект.РасшифровкаПлатежа.Итог("Сумма");
	
	Если СуммаДокумента = 0 Тогда
		
		#Если Клиент Тогда
			Предупреждение("Сумма документа не может быть нулевой!");
		#Иначе
			Сообщить("Сумма документа не может быть нулевой!", СтатусСообщения.Важное);
		#КонецЕсли
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	ТекДата = ТекущаяДатаСеанса();
	ДоговорСубконто = ПланыВидовХарактеристик.ВидыСубконто_ат.Договор;
	ДокументСубконто = ПланыВидовХарактеристик.ВидыСубконто_ат.Документ;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СписаниеСоСчетаКлиента_атРасшифровкаПлатежа.Реализация,
		|	СписаниеСоСчетаКлиента_атРасшифровкаПлатежа.Сумма,
		|	ВЫБОР
		|		КОГДА СписаниеСоСчетаКлиента_атРасшифровкаПлатежа.Реализация.Договор.Родитель = ЗНАЧЕНИЕ(Справочник.Договоры_ат.ПустаяСсылка)
		|			ТОГДА СписаниеСоСчетаКлиента_атРасшифровкаПлатежа.Реализация.Договор
		|			ИНАЧЕ СписаниеСоСчетаКлиента_атРасшифровкаПлатежа.Реализация.Договор.Родитель
		|		КОНЕЦ КАК ДоговорОсновной,
		|	СписаниеСоСчетаКлиента_атРасшифровкаПлатежа.Реализация.Договор КАК ДоговорРеализации
		|ИЗ
		|	Документ.СписаниеСоСчетаКлиента_ат.РасшифровкаПлатежа КАК СписаниеСоСчетаКлиента_атРасшифровкаПлатежа
		|ГДЕ
		|	СписаниеСоСчетаКлиента_атРасшифровкаПлатежа.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДвижениеФакт = Движения.Клиентский_ат.Добавить();
		
		ДвижениеФакт.Период 					= Дата;
		ДвижениеФакт.Клиент 					= Клиент;
		ДвижениеФакт.Счет 						= ПланыСчетов.Клиентский_ат.Фактический;
		ДвижениеФакт.ВидДвижения 				= ВидДвиженияБухгалтерии.Кредит;
		ДвижениеФакт.Субконто[ДоговорСубконто] 	= Выборка.ДоговорОсновной;
		ДвижениеФакт.Субконто[ДокументСубконто] = Выборка.Реализация;
		ДвижениеФакт.Сумма 						= Выборка.Сумма;
		
		ДвижениеФакт.Договор 					= Выборка.ДоговорРеализации;
		ДвижениеФакт.Организация 				= Организация;
		
		ДвижениеФакт.АвторИзменения 			= ТекПользователь;
		ДвижениеФакт.ДатаИзменения 				= ТекДата;
		
	КонецЦикла;
	
	Движения.Клиентский_ат.Записать();
	
	Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
		
		Для каждого СтрокаКосвенныхСвязей Из СтрокаРасшифровки.Реализация.КосвенныеСвязиЗаданий Цикл
			
			Согласование_ат.ЗаписатьКосвеннуюСвязьЗадания(СтрокаКосвенныхСвязей.Задание, СтрокаКосвенныхСвязей.Заявка,,,,,,
				Ссылка, Клиент, СтрокаКосвенныхСвязей.Задание.СодержаниеРабот);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Уведомления_ат.УведомитьОСписанииДенежныхСредств(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
		
		Для каждого СтрокаКосвенныхСвязей Из СтрокаРасшифровки.Реализация.КосвенныеСвязиЗаданий Цикл
			
			Согласование_ат.ЗаписатьКосвеннуюСвязьЗадания(СтрокаКосвенныхСвязей.Задание, СтрокаКосвенныхСвязей.Заявка,,,,,,
				Документы.СписаниеСоСчетаКлиента_ат.ПустаяСсылка(), Клиент, СтрокаКосвенныхСвязей.Задание.СодержаниеРабот);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Уведомления_ат.УведомитьОСписанииДенежныхСредств(Ссылка, Истина);
	
КонецПроцедуры

#КонецОбласти
